Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1160/periph/PERI_IOMUXC_LPSR_GPR.h
/*! @name GPR15 - GPR15 General Purpose Register */
/*! @{ */

#define IOMUXC_LPSR_GPR_GPR15_LOCK_MASK          (0x1U)
#define IOMUXC_LPSR_GPR_GPR15_LOCK_SHIFT         (0U)
/*! LOCK - Lock the write to bit 31:1
 *  0b0..Write access to bit 31:1 is not blocked
 *  0b1..Write access to bit 31:1 is blocked
 */
#define IOMUXC_LPSR_GPR_GPR15_LOCK(x)            (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPSR_GPR_GPR15_LOCK_SHIFT)) & IOMUXC_LPSR_GPR_GPR15_LOCK_MASK)

#define IOMUXC_LPSR_GPR_GPR15_APC_AC_R6_TOP_MASK (0xFFFFFFF8U)
#define IOMUXC_LPSR_GPR_GPR15_APC_AC_R6_TOP_SHIFT (3U)
/*! APC_AC_R6_TOP - APC end address of memory region-6 */
#define IOMUXC_LPSR_GPR_GPR15_APC_AC_R6_TOP(x)   (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPSR_GPR_GPR15_APC_AC_R6_TOP_SHIFT)) & IOMUXC_LPSR_GPR_GPR15_APC_AC_R6_TOP_MASK)
/*! @} */

/*! @name GPR16 - GPR16 General Purpose Register */
/*! @{ */

#define IOMUXC_LPSR_GPR_GPR16_LOCK_MASK          (0x1U)
#define IOMUXC_LPSR_GPR_GPR16_LOCK_SHIFT         (0U)
/*! LOCK - Lock the write to bit 31:1
 *  0b0..Write access to bit 31:1 is not blocked
 *  0b1..Write access to bit 31:1 is blocked
 */
#define IOMUXC_LPSR_GPR_GPR16_LOCK(x)            (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPSR_GPR_GPR16_LOCK_SHIFT)) & IOMUXC_LPSR_GPR_GPR16_LOCK_MASK)

#define IOMUXC_LPSR_GPR_GPR16_APC_AC_R7_BOT_MASK (0xFFFFFFF8U)
#define IOMUXC_LPSR_GPR_GPR16_APC_AC_R7_BOT_SHIFT (3U)
/*! APC_AC_R7_BOT - APC start address of memory region-7 */
#define IOMUXC_LPSR_GPR_GPR16_APC_AC_R7_BOT(x)   (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPSR_GPR_GPR16_APC_AC_R7_BOT_SHIFT)) & IOMUXC_LPSR_GPR_GPR16_APC_AC_R7_BOT_MASK)
/*! @} */

/*! @name GPR17 - GPR17 General Purpose Register */
/*! @{ */

#define IOMUXC_LPSR_GPR_GPR17_LOCK_MASK          (0x1U)
#define IOMUXC_LPSR_GPR_GPR17_LOCK_SHIFT         (0U)
/*! LOCK - Lock the write to bit 31:1
 *  0b0..Write access to bit 31:1 is not blocked
 *  0b1..Write access to bit 31:1 is blocked
 */
#define IOMUXC_LPSR_GPR_GPR17_LOCK(x)            (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPSR_GPR_GPR17_LOCK_SHIFT)) & IOMUXC_LPSR_GPR_GPR17_LOCK_MASK)

#define IOMUXC_LPSR_GPR_GPR17_APC_AC_R7_TOP_MASK (0xFFFFFFF8U)
#define IOMUXC_LPSR_GPR_GPR17_APC_AC_R7_TOP_SHIFT (3U)
/*! APC_AC_R7_TOP - APC end address of memory region-7 */
#define IOMUXC_LPSR_GPR_GPR17_APC_AC_R7_TOP(x)   (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPSR_GPR_GPR17_APC_AC_R7_TOP_SHIFT)) & IOMUXC_LPSR_GPR_GPR17_APC_AC_R7_TOP_MASK)
/*! @} */

/*! @name GPR18 - GPR18 General Purpose Register */
/*! @{ */

#define IOMUXC_LPSR_GPR_GPR18_APC_R0_ENCRYPT_ENABLE_MASK (0x10U)
#define IOMUXC_LPSR_GPR_GPR18_APC_R0_ENCRYPT_ENABLE_SHIFT (4U)
/*! APC_R0_ENCRYPT_ENABLE - APC memory region-0 encryption enable
 *  0b0..No effect
 *  0b1..Encryption enabled
 */
#define IOMUXC_LPSR_GPR_GPR18_APC_R0_ENCRYPT_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPSR_GPR_GPR18_APC_R0_ENCRYPT_ENABLE_SHIFT)) & IOMUXC_LPSR_GPR_GPR18_APC_R0_ENCRYPT_ENABLE_MASK)

#define IOMUXC_LPSR_GPR_GPR18_LOCK_MASK          (0xFFFF0000U)
#define IOMUXC_LPSR_GPR_GPR18_LOCK_SHIFT         (16U)
/*! LOCK - Lock the write to bit 15:0 */
#define IOMUXC_LPSR_GPR_GPR18_LOCK(x)            (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPSR_GPR_GPR18_LOCK_SHIFT)) & IOMUXC_LPSR_GPR_GPR18_LOCK_MASK)
/*! @} */

/*! @name GPR19 - GPR19 General Purpose Register */
/*! @{ */

#define IOMUXC_LPSR_GPR_GPR19_APC_R1_ENCRYPT_ENABLE_MASK (0x10U)
#define IOMUXC_LPSR_GPR_GPR19_APC_R1_ENCRYPT_ENABLE_SHIFT (4U)
/*! APC_R1_ENCRYPT_ENABLE - APC memory region-1 encryption enable
 *  0b0..No effect
 *  0b1..Encryption enabled
 */
#define IOMUXC_LPSR_GPR_GPR19_APC_R1_ENCRYPT_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPSR_GPR_GPR19_APC_R1_ENCRYPT_ENABLE_SHIFT)) & IOMUXC_LPSR_GPR_GPR19_APC_R1_ENCRYPT_ENABLE_MASK)

#define IOMUXC_LPSR_GPR_GPR19_LOCK_MASK          (0xFFFF0000U)
#define IOMUXC_LPSR_GPR_GPR19_LOCK_SHIFT         (16U)
/*! LOCK - Lock the write to bit 15:0 */
#define IOMUXC_LPSR_GPR_GPR19_LOCK(x)            (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPSR_GPR_GPR19_LOCK_SHIFT)) & IOMUXC_LPSR_GPR_GPR19_LOCK_MASK)
/*! @} */

/*! @name GPR20 - GPR20 General Purpose Register */
/*! @{ */

#define IOMUXC_LPSR_GPR_GPR20_APC_R2_ENCRYPT_ENABLE_MASK (0x10U)
#define IOMUXC_LPSR_GPR_GPR20_APC_R2_ENCRYPT_ENABLE_SHIFT (4U)
/*! APC_R2_ENCRYPT_ENABLE - APC memory region-2 encryption enable
 *  0b0..No effect
 *  0b1..Encryption enabled
 */
#define IOMUXC_LPSR_GPR_GPR20_APC_R2_ENCRYPT_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPSR_GPR_GPR20_APC_R2_ENCRYPT_ENABLE_SHIFT)) & IOMUXC_LPSR_GPR_GPR20_APC_R2_ENCRYPT_ENABLE_MASK)

#define IOMUXC_LPSR_GPR_GPR20_LOCK_MASK          (0xFFFF0000U)
#define IOMUXC_LPSR_GPR_GPR20_LOCK_SHIFT         (16U)
/*! LOCK - Lock the write to bit 15:0 */
#define IOMUXC_LPSR_GPR_GPR20_LOCK(x)            (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPSR_GPR_GPR20_LOCK_SHIFT)) & IOMUXC_LPSR_GPR_GPR20_LOCK_MASK)
/*! @} */

/*! @name GPR21 - GPR21 General Purpose Register */
/*! @{ */

#define IOMUXC_LPSR_GPR_GPR21_APC_R3_ENCRYPT_ENABLE_MASK (0x10U)
#define IOMUXC_LPSR_GPR_GPR21_APC_R3_ENCRYPT_ENABLE_SHIFT (4U)
/*! APC_R3_ENCRYPT_ENABLE - APC memory region-3 encryption enable
 *  0b0..No effect
 *  0b1..Encryption enabled
 */
#define IOMUXC_LPSR_GPR_GPR21_APC_R3_ENCRYPT_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPSR_GPR_GPR21_APC_R3_ENCRYPT_ENABLE_SHIFT)) & IOMUXC_LPSR_GPR_GPR21_APC_R3_ENCRYPT_ENABLE_MASK)

#define IOMUXC_LPSR_GPR_GPR21_LOCK_MASK          (0xFFFF0000U)
#define IOMUXC_LPSR_GPR_GPR21_LOCK_SHIFT         (16U)
/*! LOCK - Lock the write to bit 15:0 */
#define IOMUXC_LPSR_GPR_GPR21_LOCK(x)            (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPSR_GPR_GPR21_LOCK_SHIFT)) & IOMUXC_LPSR_GPR_GPR21_LOCK_MASK)
/*! @} */

/*! @name GPR22 - GPR22 General Purpose Register */
/*! @{ */

#define IOMUXC_LPSR_GPR_GPR22_APC_R4_ENCRYPT_ENABLE_MASK (0x10U)
#define IOMUXC_LPSR_GPR_GPR22_APC_R4_ENCRYPT_ENABLE_SHIFT (4U)
/*! APC_R4_ENCRYPT_ENABLE - APC memory region-4 encryption enable
 *  0b0..No effect
 *  0b1..Encryption enabled
 */
#define IOMUXC_LPSR_GPR_GPR22_APC_R4_ENCRYPT_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPSR_GPR_GPR22_APC_R4_ENCRYPT_ENABLE_SHIFT)) & IOMUXC_LPSR_GPR_GPR22_APC_R4_ENCRYPT_ENABLE_MASK)

#define IOMUXC_LPSR_GPR_GPR22_LOCK_MASK          (0xFFFF0000U)
#define IOMUXC_LPSR_GPR_GPR22_LOCK_SHIFT         (16U)
/*! LOCK - Lock the write to bit 15:0 */
#define IOMUXC_LPSR_GPR_GPR22_LOCK(x)            (((uint32_t)(((uint32_t)(x)) << IOMUXC_LPSR_GPR_GPR22_LOCK_SHIFT)) & IOMUXC_LPSR_GPR_GPR22_LOCK_MASK)
/*! @} */

/*! @name GPR23 - GPR23 General Purpose Register */
/*! @{ */

